package com.stormphoenix.fishcollector.shared.constants;

/**
 * @author CJX
 *         Created on 2016/5/25.
 *         存放静态数据
 */
public class Constants {

    public static final String[] PROVINCE = {"北京市", "天津市", "重庆市", "上海市",
            "河北省", "山西省", "辽宁省", "吉林省", "黑龙江省", "江苏省", "浙江省", "安徽省", "福建省", "江西省",
            "山东省", "河南省", "湖北省", "湖南省", "广东省", "海南省", "四川省", "贵州省", "云南省", "陕西省",
            "甘肃省", "青海省", "台湾省", "内蒙古自治区", "广西壮族自治区", "西藏自治区", "宁夏回族自治区",
            "新疆维吾尔自治区", "香港特别行政区", "澳门特别行政区"};
    public static final String[][] CITY = {{"东城区", "西城区", "海淀区", "朝阳区", "丰台区", "石景山区",
            "通州区", "顺义区", "房山区", "大兴区", "昌平区", "怀柔区", "平谷区", "门头沟区", "密云县", "延庆县"},
            {"和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "滨海新区"},
            {"万州区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "渝北区", "永川区",
                    "璧山区", "大足区", "北碚区", "綦江区", "江津区", "合川区", "巴南区", "黔江区", "长寿区", "南川区",
                    "铜梁区", "潼南区", "荣昌区", "梁平县", "城口县", "丰都县", "垫江县", "武隆县", "忠县", "开县",
                    "云阳县", "奉节县", "巫山县", "巫溪县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县"},
            {"黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "南汇区", "奉贤区", "崇明县"},
            {"石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "沧州市", "廊坊市", "衡水市"},
            {"太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市"},
            {"沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛"},
            {"长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "白城市", "松原市", "延边朝鲜族自治州", "吉林省长白山保护开发区", "梅河口", "公主岭"},
            {"哈尔滨市", "齐齐哈尔市", "鸡西市", "鹤岗市", "双鸭山市", "大庆市", "伊春市", "佳木斯市", "七台河市", "牡丹江市", "黑河市", "绥化市", "大兴安岭地区"},
            {"南京", "无锡", "徐州", "常州", "苏州", "南通", "连云港", "淮安", "盐城", "扬州", "镇江", "泰州", "宿迁"},
            {"杭州", "宁波", "温州", "绍兴", "湖州", "嘉兴", "金华", "衢州", "台州", "丽水", "舟山"},
            {"合肥", "芜湖", "蚌埠", "淮南", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "阜阳", "宿州", "滁州", "六安", "宣城", "池州", "亳州"},
            {"福州市", "厦门市", "莆田市", "三明市", "泉州市", "金门县", "南平市", "龙岩市", "宁德市"},
            {"南昌市", "九江市", "新余市", "景德镇市", "赣州市", "吉安市", "抚州市", "萍乡市", "鹰潭市", "宜春市", "上饶市"},
            {"济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "滨州", "德州", "聊城", "临沂", "菏泽", "莱芜"},
            {"郑州市", "开封市", "洛阳市", "平顶山市", "安阳市", "鹤壁市", "新乡市", "焦作市", "濮阳市", "许昌市", "漯河市", "三门峡市", "商丘市", "周口市", "驻马店市", "南阳市", "信阳市", "济源市"},
            {"武汉市", "黄冈市", "黄石市", "荆门市", "荆州市", "鄂州市", "十堰市", "随州市", "孝感市", "咸宁市", "襄阳市", "宜昌市", "恩施土家族苗族自治州", "神农架林区", "潜江市", "天门市", "仙桃市"},
            {"长沙市", "株洲市", "湘潭市", "衡阳市", "邵阳市", "岳阳市", "常德市", "张家界市", "益阳市", "郴州市", "永州市", "怀化市", "娄底市", "湘西土家族苗族自治州"},
            {"广州市", "深圳市", "珠海市", "汕头市", "佛山市", "韶关市", "湛江市", "肇庆市", "江门市", "茂名市", "惠州市", "梅州市", "汕尾市", "河源市", "阳江市", "清远市", "东莞市", "中山市", "潮州市", "揭阳市", "云浮市"},
            {"海口市", "三亚市", "三沙市", "儋州市"},
            {"成都市", "绵阳市", "自贡市", "攀枝花市", "泸州市", "德阳市", "广元市", "遂宁市", "内江市", "乐山市", "资阳市", "宜宾市", "南充市", "达州市", "雅安市", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州", "广安市", "巴中市", "眉山市"},
            {"贵阳市", "六盘水市", "遵义市", "安顺市", "毕节市", "铜仁市", "黔西南布依族苗族自治州", "黔东南苗族侗族自治州", "黔南布依族苗族自治州"},
            {"昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "普洱市", "临沧市", "文山壮族苗族自治州", "红河哈尼族彝族自治州", "楚雄彝族自治州", "大理白族自治州", "西双版纳傣族自治州", "德宏傣族景颇族自治州", "怒江傈僳族自治州", "迪庆藏族自治州"},
            {"西安市", "宝鸡市", "咸阳市", "渭南市", "铜川市", "延安市", "榆林市", "安康市", "汉中市", "商洛市", "杨凌示范区"},
            {"兰州市", "嘉峪关市", "金昌市", "白银市", "天水市", "酒泉市", "张掖市", "武威市", "定西市", "陇南市", "平凉市", "庆阳市", "临夏回族自治州", "甘南藏族自治州"},
            {"西宁市", "海东市", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州", "果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州"},
            {"台北市", "新北市", "桃园市", "台中市", "台南市", "高雄市", "基隆市", "新竹市", "嘉义市"},
            {"呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "兴安盟", "锡林郭勒盟", "阿拉善盟"},
            {"南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市", "贵港市", "玉林市", "百色市", "贺州市", "河池市", "来宾市", "崇左市"},
            {"拉萨市", "昌都市", "日喀则市", "林芝市", "山南市", "那曲地区", "阿里地区"},
            {"银川市", "石嘴山市", "吴忠市", "固原市", "中卫市"},
            {"乌鲁木齐市", "克拉玛依市", "吐鲁番市", "哈密市", "阿克苏地区", "喀什地区", "和田地区", "昌吉回族自治州", "博尔塔拉蒙古自治州", "巴音郭楞蒙古自治州", "克孜勒苏柯尔克孜自治州", "伊犁哈萨克自治州", "石河子市", "阿拉尔市", "图木舒克市", "五家渠市", "北屯市", "铁门关市", "双河市", "可克达拉市", "昆玉市"},
            {"中西区", "湾仔区", "东区", "南区", "油尖旺区", "深水埗区", "九龙城区", "黄大仙区", "观塘区", "北区", "大埔区", "沙田区", "西贡区", "荃湾区", "屯门区", "元朗区", "葵青区", "离岛区"},
            {"花地玛堂区", "圣安多尼堂区", "大堂区", "望德堂区", "风顺堂区", "嘉模堂区", "圣方济各堂区", "路氹城"}
    };

    public static final String[] SAMPLE_POSITION = {"左岸", "右岸", "中间"};

    public static final String[] SAMPLE_WEATHER = {"晴", "阴", "多云", "少云", "小雨", "中雨", "大雨", "阵雨", "雷阵雨", "暴雨", "雪"};

    public static final String[] WATER_LAYER = {"上", "中", "下"};

    public static final int INPUTMOREDATA = 1;
    public static final int FRACTURESURFACE_SUCCESSFUL = 2;
    public static final int MEASURINGLINE_SUCCESSFUL = 3;
    public static final int SEDIMENT_SUCCESSFUL = 4;
    public static final int ZOOPLANKTON_SUCCESSFUL = 5;
    public static final int PHYTOPLANKTON_SUCCESSFUL = 6;
    public static final int BENTHICORGANISM_SUCCESSFUL = 7;
    public static final int MEASURINGSITE_SUCCESSFUL = 8;
    public static final int WATERCOURSE_SUCCESSFUL = 9;
    public static final int CATCH_SUCCESSFUL = 10;
    public static final int NETTINGGEAR_SUCCESSFUL = 11;
    public static final int FISHSAMPLE_SUCCESSFUL = 12;
    public static final int EGGSAMPLE_SUCCESSFUL = 13;
    public static final int DOMINANTSPECIES_SUCCESSFUL = 14;

    public static final String[] TITLE = {"我的任务", "分配任务"};

    public static final int REQUEST_GET_PHOTO_FROM_CAMERA = 11;

    // 用户登录失败，或者用户不存在
    public static final int LOGIN_FAILED = 100;
    // 用户登录成功，并且在组内
    public static final int LOGIN_SUCCESS_IN_GROUP = 101;
    // 用户登录成功，但不在组内
    public static final int LOGIN_SUCCESS_NOT_IN_GROUP = 102;
    // 用户不存在
    public static final int USER_NOT_EXISTS = 103;
    // 创建分组成功
    public static final int CREATE_GROUP_SUCCESS = 104;
    // 用户已经在某一个组内了
    public static final int USER_ALREADY_IN_GROUP = 105;
}
